InformationRegisters/ЛБ_СтатусыОбъектовЗалогаВНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СтатусыОбъектовЗалогаВНакладной</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НакладнаяНаОтгрузку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_НакладнаяНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_СостояниеОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиНачальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаДолгаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_РеквизитыОбъектаЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеквизитыОбъектаЗалога</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИзделия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыИзделий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проба</Name>
					<Comment>Проба</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Пробы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Клеймо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКлейм</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеИменника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеИзделия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СостояниеИзделия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дефекты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Comment>Вес изделия</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесЧистый</Name>
					<Comment>Чистый вес</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесВПробеЧистоты</Name>
					<Comment>Вес в пробе чистоты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзделия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиМеталлы</Name>
					<Comment>Сумма оценки металлов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценкиКамни</Name>
					<Comment>Сумма оценки драг. камней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСсуды</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вставки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Вес30</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОЗ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаОткрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СумкаЗакрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключенИзНакладной</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ФормаИсключенияИзНакладнойНаОтгрузку/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	Если Параметры.Свойство("Документ") Тогда
		Документ = Параметры.Документ; 
		Если Документ.Проведен тогда
		   СостояниеДокумента = 1;
		ИначеЕсли Документ.ПометкаУдаления тогда
		   СостояниеДокумента = 2;
        КонецЕсли;
		ЗаполнитьСписокЗБПоДокументу();
		ЗаполнитьТаблицу();
		Элементы.ГруппаДокумент.Видимость = Истина; 
		Элементы.ГруппаДокументПодвал.Видимость = Истина;
		Элементы.ДекорацияИсключитьИзНакладной.Видимость = Ложь;
		Элементы.ТаблицаВыбора.КоманднаяПанель.Видимость = ложь; 
		Элементы.ТаблицаВыбораВкл.Видимость = Ложь;  
		ЭтаФорма.Заголовок = Метаданные.Документы.ЛБ_КорректировкаНакладной.Синоним + ": " + Строка(Документ.ВидОперации);;
	Иначе
		Если Параметры.Свойство("Организация") Тогда
			Организация = Параметры.Организация; 
		Иначе
			Отказ = Истина;
		КонецЕсли;	
	    ИнформацияДляПользователя(); 
		ЭтаФорма.Заголовок = "Исключение ЗБ из накладной на отгрузку";
	КонецЕсли;	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокЗБПоДокументу()
	СписокЗБ.Очистить();
	Для каждого стр Из Документ.ЗалоговыеБилеты Цикл 
		Если СписокЗБ.НайтиПоЗначению(Стр.ЗалоговыйБилет) = неопределено Тогда 
			СписокЗБ.Добавить(Стр.ЗалоговыйБилет);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ИнформацияДляПользователя() 
	Если ТаблицаВыбора.Количество() = 0 тогда 
		Элементы.ДекорацияИсключитьИзНакладной.Заголовок = "Всего ЗБ – 0, предметов залога - 0"; 
	Иначе   
		ТаблицаЗБ = ТаблицаВыбора.Выгрузить();
		ТаблицаЗБ.Свернуть("ЗалоговыйБилет");
		Элементы.ДекорацияИсключитьИзНакладной.Заголовок = "Всего ЗБ – " + Строка(ТаблицаЗБ.Количество()) + ", предметов залога - " + Строка(ТаблицаВыбора.Количество());
		
		Ном = 0;
		Для каждого Стр Из ТаблицаВыбора Цикл 
			Если ЗначениеЗаполнено(Стр.СтатусЗалогаПосле) Тогда  
				Ном = Ном + 1;
			КонецЕсли;	
		КонецЦикла;	
		Если НЕ Ном = 0 тогда 
		    Элементы.ДекорацияИсключитьИзНакладной.Заголовок = Элементы.ДекорацияИсключитьИзНакладной.Заголовок + Символы.ПС + "Предметов залога в статусе «Вкл. в накл»/ «Объявл. торг» - " + Строка(Ном) + " (подлежат исключению из накладной)";
		Иначе  
			Элементы.ДекорацияИсключитьИзНакладной.Заголовок = Элементы.ДекорацияИсключитьИзНакладной.Заголовок + Символы.ПС + "Предметов залога в статусе «Вкл. в накл»/ «Объявл. торг» - 0 (подлежат исключению из накладной)";
		КонецЕсли;
		
		СписокНеВкл1 = Новый СписокЗначений;  
		СписокНеВкл2 = Новый СписокЗначений;
		Отбор = новый Структура;
		Отбор.Вставить("Вкл", Ложь);
		Строки = ТаблицаВыбора.НайтиСтроки(Отбор); 
		Для каждого Стр Из Строки Цикл   
			Если ЗначениеЗаполнено(Стр.СтатусЗалогаПосле) Тогда 
				Продолжить;
			КонецЕсли;	
			Если Стр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную ИЛИ
			     Стр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг Тогда
				СписокНеВкл2.Добавить(Стр.Артикул); 
			Иначе   
				СписокНеВкл1.Добавить(Стр.Артикул);
			КонецЕсли;	
		КонецЦикла;   
		Если НЕ СписокНеВкл1.Количество() = 0 Тогда
		    Элементы.ДекорацияИсключитьИзНакладной.Заголовок = Элементы.ДекорацияИсключитьИзНакладной.Заголовок + Символы.ПС + 
			                                                 "Предметов залога в иных статусах – " + Строка(СписокНеВкл1.Количество()) + 
			                                                 " (НЕ подлежат исключению из накладной залоги с артикулом";  
			Ном = 0;
			Для каждого Эл Из СписокНеВкл1 Цикл  
				Элементы.ДекорацияИсключитьИзНакладной.Заголовок = Элементы.ДекорацияИсключитьИзНакладной.Заголовок + ?(Ном = 0, " ", ", ") + "№ " + СокрЛП(Эл.Значение); 
				Ном = 0;
			КонецЦикла;   
			Элементы.ДекорацияИсключитьИзНакладной.Заголовок = Элементы.ДекорацияИсключитьИзНакладной.Заголовок + ")"; 
		КонецЕсли;	
		Если НЕ СписокНеВкл2.Количество() = 0 Тогда
		    Элементы.ДекорацияИсключитьИзНакладной.Заголовок = Элементы.ДекорацияИсключитьИзНакладной.Заголовок + Символы.ПС + 
			        "Предметов залога в статусе «Вкл. в накл»/ «Объявл. торг», накладная в статусе «Сумка открыта»/«Сумка закрыта»/«Отгружена» – " + Строка(СписокНеВкл2.Количество()) + 
			        " (НЕ подлежат исключению из накладной залоги с артикулом";  
			Ном = 0;
			Для каждого Эл Из СписокНеВкл2 Цикл  
				Элементы.ДекорацияИсключитьИзНакладной.Заголовок = Элементы.ДекорацияИсключитьИзНакладной.Заголовок + ?(Ном = 0, " ", ", ") + "№ " + СокрЛП(Эл.Значение); 
				Ном = 0;
			КонецЦикла;   
			Элементы.ДекорацияИсключитьИзНакладной.Заголовок = Элементы.ДекорацияИсключитьИзНакладной.Заголовок + ")"; 
		КонецЕсли;	
	КонецЕсли;	    
	
КонецПроцедуры	
	 
&НаКлиенте
Процедура ВыбратьЗБ(Команда)
	ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Организация", Организация); 
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЗБ", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.ЛБ_ВыборЗалоговыхБилетов", ПараметрыФормы ,,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры  

&НаСервере
Функция ПолучитьКолИсключений(ОбъектЗалога)
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);   
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладной.Период КАК Период
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной КАК ЛБ_СтатусыОбъектовЗалогаВНакладной
	               |ГДЕ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладной.ОбъектЗалога = &ОбъектЗалога
	               |	И ЛБ_СтатусыОбъектовЗалогаВНакладной.Статус = ЗНАЧЕНИЕ(Перечисление.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.ИсключенИзНакладной)
	               |	И ЛБ_СтатусыОбъектовЗалогаВНакладной.Регистратор ССЫЛКА Документ.ЛБ_КорректировкаНакладной";
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	Возврат ТаблицаРезультат.Количество();
КонецФункции

&НаСервере
Функция ПолучитьСтатусыПослеИсключения(Накладная, ЗалоговыйБилет, ОбъектЗалога) 
	МоментДоДокумента = Новый Граница(Новый МоментВремени(Накладная.Дата, Накладная), ВидГраницы.Исключая); 
	Результат = Новый Структура;
	Результат.Вставить("СтатусЗБ"); 
	Результат.Вставить("СтатусЗалога");
	 
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", МоментДоДокумента);
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗБ
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() тогда 
		Результат.СтатусЗБ = Выборка.СтатусЗБ;
	КонецЕсли;	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(
	               |			&Дата,
	               |			ЗалоговыйБилет = &ЗалоговыйБилет
	               |				И ОбъектЗалога = &ОбъектЗалога) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних"; 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() тогда 
		Результат.СтатусЗалога = Выборка.СтатусОбъектаЗалога;
	КонецЕсли;	
    Возврат Результат;
КонецФункции        

&НаСервере
Функция ПолучитьСтатусыПослеИсключенияДокумент(ЗалоговыйБилет, ОбъектЗалога) 
	Результат = Новый Структура;
	Результат.Вставить("СтатусЗБ"); 
	Результат.Вставить("СтатусЗалога");
	 
	Запрос = Новый Запрос;   
	Запрос.УстановитьПараметр("Регистратор", Документ); 
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Запрос.УстановитьПараметр("ОбъектЗалога", ОбъектЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗБ
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор = &Регистратор
	               |	И ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет";
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() тогда 
		Результат.СтатусЗБ = Выборка.СтатусЗБ;
	КонецЕсли;	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалога.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога КАК ЛБ_СостояниеОбъектаЗалога
	               |ГДЕ
	               |	ЛБ_СостояниеОбъектаЗалога.Регистратор = &Регистратор
	               |	И ЛБ_СостояниеОбъектаЗалога.ОбъектЗалога = &ОбъектЗалога
	               |	И ЛБ_СостояниеОбъектаЗалога.ЗалоговыйБилет = &ЗалоговыйБилет"; 
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() тогда 
		Результат.СтатусЗалога = Выборка.СтатусОбъектаЗалога;
	КонецЕсли;	
    Возврат Результат;
КонецФункции

	
&НаСервере
Процедура ЗаполнитьТаблицу()
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("СписокЗБ", СписокЗБ); 
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Документ), Документ.Дата-1, ТекущаяДатаСеанса()));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Период КАК Период,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.НакладнаяНаОтгрузку КАК НакладнаяНаОтгрузку,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних.Статус КАК Статус
	               |ИЗ
	               |	РегистрСведений.ЛБ_СтатусыОбъектовЗалогаВНакладной.СрезПоследних(&Дата, ЗалоговыйБилет В (&СписокЗБ)) КАК ЛБ_СтатусыОбъектовЗалогаВНакладнойСрезПоследних
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период УБЫВ";
	ТаблицаН = Запрос.Выполнить().Выгрузить();   
	
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет КАК ЗалоговыйБилет,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.Артикул КАК Артикул,
	               |	ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_СостояниеОбъектаЗалогаСрезПоследних.СтатусОбъектаЗалога КАК СтатусОбъектаЗалога,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет В (&СписокЗБ)) КАК ЛБ_СостояниеОбъектаЗалогаСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_СостояниеЗалоговогоБилета.СрезПоследних(&Дата, ЗалоговыйБилет В (&СписокЗБ)) КАК ЛБ_СостояниеЗалоговогоБилетаСрезПоследних
	               |		ПО ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_СостояниеЗалоговогоБилетаСрезПоследних.ЗалоговыйБилет
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛБ_РеквизитыОбъектаЗалога.СрезПоследних(&Дата, ЗалоговыйБилет В (&СписокЗБ)) КАК ЛБ_РеквизитыОбъектаЗалогаСрезПоследних
	               |		ПО ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ЗалоговыйБилет = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ЗалоговыйБилет
	               |			И ЛБ_СостояниеОбъектаЗалогаСрезПоследних.ОбъектЗалога = ЛБ_РеквизитыОбъектаЗалогаСрезПоследних.ОбъектЗалога";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	//ТаблицаВыбора.Очистить();     
	Для каждого Эл из СписокЗБ Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("ЗалоговыйБилет", Эл.Значение);
		
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;     
		Для сч = 0 По строки.Количество()-1 Цикл
			Стр = Строки.Получить(сч);
			НоваяСтр = ТаблицаВыбора.Добавить();
			НоваяСтр.ЗалоговыйБилет = Стр.ЗалоговыйБилет; 
			НоваяСтр.Залогодатель = Стр.ЗалоговыйБилет.Залогодатель; 
			НоваяСтр.Ломбард = Стр.ЗалоговыйБилет.Ломбард;
			НоваяСтр.Артикул = Стр.Артикул;
			НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;
			НоваяСтр.ДатаВыкупаЛьготная = Стр.ДатаВыкупаЛьготныйСрок;
			НоваяСтр.СтатусЗалоговогоБилета = Стр.СтатусЗалоговогоБилета;
			НоваяСтр.СтатусОбъектаЗалога = Стр.СтатусОбъектаЗалога; 
			ОтборН = Новый Структура;
			ОтборН.Вставить("ЗалоговыйБилет", НоваяСтр.ЗалоговыйБилет);
			ОтборН.Вставить("ОбъектЗалога", НоваяСтр.ОбъектЗалога);
			СтрокиН = ТаблицаН.НайтиСтроки(ОтборН);
			Если НЕ СтрокиН.Количество() = 0 Тогда
				СтрН = строкиН.Получить(0);
				НоваяСтр.НакладнаяНаОтгрузку = СтрН.НакладнаяНаОтгрузку; 
				НоваяСтр.СтатусВНакладной = СтрН.Статус;   
			КонецЕсли;	
			НоваяСтр.КоличествоИсключений = ПолучитьКолИсключений(НоваяСтр.ОбъектЗалога); 
			Если ЗначениеЗаполнено(Документ) Тогда  
				Результат = ПолучитьСтатусыПослеИсключенияДокумент(НоваяСтр.ЗалоговыйБилет, НоваяСтр.ОбъектЗалога);  
				Если НЕ Результат = неопределено Тогда
				   НоваяСтр.СтатусЗБПосле = Результат.СтатусЗБ;
				   НоваяСтр.СтатусЗалогаПосле = Результат.СтатусЗалога;
				КонецЕсли;  
			Иначе	
				Если НоваяСтр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ВключенВНакладную ИЛИ
					 НоваяСтр.СтатусОбъектаЗалога = Перечисления.ЛБ_СтатусыОбъектовЗалога.ОбъявленТорг Тогда	 
				    НоваяСтр.Вкл = Истина;   
					Если НЕ НоваяСтр.СтатусВНакладной = Перечисления.ЛБ_СтатусыОбъектовЗалогаНакладнойНаОтгрузку.Факт Тогда	
						НоваяСтр.Вкл = Ложь; 
					КонецЕсли;	
				КонецЕсли;	
				Если НоваяСтр.Вкл Тогда
					Результат = ПолучитьСтатусыПослеИсключения(НоваяСтр.НакладнаяНаОтгрузку, НоваяСтр.ЗалоговыйБилет, НоваяСтр.ОбъектЗалога);  
					Если НЕ Результат = неопределено Тогда
					   НоваяСтр.СтатусЗБПосле = Результат.СтатусЗБ;
					   НоваяСтр.СтатусЗалогаПосле = Результат.СтатусЗалога;
					КонецЕсли;   
				КонецЕсли;  
			КонецЕсли;
		КонецЦикла;	
	Конеццикла;	      
	
	Если ЗначениеЗаполнено(Документ) Тогда
		Запрос.УстановитьПараметр("Регистратор", Документ);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_ЗалоговыеБилетыЗаблокированные.ЗалоговыйБилет КАК ЗалоговыйБилет,
		               |	ЛБ_ЗалоговыеБилетыЗаблокированные.ДатаБлокировки КАК ДатаБлокировки
		               |ИЗ
		               |	РегистрСведений.ЛБ_ЗалоговыеБилетыЗаблокированные КАК ЛБ_ЗалоговыеБилетыЗаблокированные
		               |ГДЕ
		               |	ЛБ_ЗалоговыеБилетыЗаблокированные.Регистратор = &Регистратор
		               |	И ЛБ_ЗалоговыеБилетыЗаблокированные.Статус = Значение(Перечисление.ЛБ_СтатусыБлокировкиЗБ.Блокировка)";  
		ТаблицаБлокировок = Запрос.Выполнить().Выгрузить();   
		
		Для каждого стр Из ТаблицаВыбора Цикл 
			Отбор = Новый Структура;
			Отбор.Вставить("ЗалоговыйБилет", Стр.ЗалоговыйБилет);
			
			СтрокиБ = ТаблицаБлокировок.НайтиСтроки(Отбор);
			Если НЕ СтрокиБ.Количество() = 0 Тогда     
				СтрБ = СтрокиБ.Получить(0);
				Стр.Блокировать = Истина;
				Стр.ДатаБлокировки = СтрБ.ДатаБлокировки;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	

КонецПроцедуры	
	
&НаКлиенте
Процедура ПослеВыбораЗБ(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	СписокЗБ = Результат; 
	ЗаполнитьТаблицу();  
	ИнформацияДляПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ИсключитьИзНакладных(Команда)       
	СписокЗБВключить = Новый СписокЗначений; 
	СписокБлокировать = Новый СписокЗначений;  
	СписокДатыБлокировки = Новый СписокЗначений;
	ВыбраныДатыБлокировки = Истина;
	Для каждого стр Из ТаблицаВыбора Цикл    
		Если Стр.Вкл Тогда
			СписокЗБВключить.Добавить(Стр.ЗалоговыйБилет);
			Если Стр.Блокировать тогда 
				СписокБлокировать.Добавить(Стр.ЗалоговыйБилет);   
				Если НЕ Стр.ДатаБлокировки = Дата(1,1,1) Тогда
				    СписокДатыБлокировки.Добавить(Стр.ДатаБлокировки); 
				Иначе
					ВыбраныДатыБлокировки = Ложь;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	Если СписокЗБВключить.Количество() = 0 Тогда
		Предупреждение("Не выбраны залоговые билеты для исключения из накладных.", 60);
	ИначеЕсли НЕ ВыбраныДатыБлокировки Тогда
		Предупреждение("Необходимо заполнить все даты блокировки залоговых билетов.", 60);
	Иначе        
		СтруктураВ = Новый Структура;
		СтруктураВ.Вставить("СписокЗБВключить", СписокЗБВключить);
		СтруктураВ.Вставить("СписокБлокировать", СписокБлокировать); 
		СтруктураВ.Вставить("СписокДатыБлокировки", СписокДатыБлокировки);
		Закрыть(СтруктураВ);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОбработатьВкл(ЗБ, Вкл) 
	Отбор = Новый структура;
	Отбор.Вставить("ЗалоговыйБилет", ЗБ);
	Строки = ТаблицаВыбора.НайтиСтроки(Отбор); 		
	Для Каждого Стр Из Строки Цикл  
		Стр.Вкл = Вкл;
		Если НЕ Вкл Тогда  
			Стр.Блокировать = Ложь;
			Стр.ДатаБлокировки = Дата(1,1,1);  
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораВклПриИзменении(Элемент)
    ТекСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные;	
	ОбработатьВкл(ТекСтрока.ЗалоговыйБилет, ТекСтрока.Вкл);
	ИнформацияДляПользователя();
КонецПроцедуры

&НаСервере
Функция ПолучитьЗБ(Идентификатор) 
	Стр = ТаблицаВыбора.НайтиПоИдентификатору(Идентификатор);
	Возврат Стр.ЗалоговыйБилет;
КонецФункции	

&НаКлиенте
Процедура ИсторияЗалоговогоБилета(Команда)
	ТекСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные; 
	ЗБ = ПолучитьЗБ(ТекСтрока.ПолучитьИдентификатор());
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ТекСтрока.Залогодатель);
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗБ);	 
							
	ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ОбработатьВклБлокировки(ЗБ, Вкл) 
	Отбор = Новый структура;
	Отбор.Вставить("ЗалоговыйБилет", ЗБ);
	Строки = ТаблицаВыбора.НайтиСтроки(Отбор); 		
	Для Каждого Стр Из Строки Цикл  
		Стр.Блокировать = Вкл;
		Если НЕ Вкл Тогда 
			Стр.ДатаБлокировки = Дата(1,1,1);   
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаВыбораЗаблокироватьПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
	   ОбработатьВклБлокировки(ТекСтрока.ЗалоговыйБилет, ТекСтрока.Блокировать);  
	КонецЕсли;   
КонецПроцедуры

&НаСервере
Процедура ОбработатьДатуБлокировки(ЗБ, ДатаБ) 
	Отбор = Новый структура;
	Отбор.Вставить("ЗалоговыйБилет", ЗБ);
	Строки = ТаблицаВыбора.НайтиСтроки(Отбор); 		
	Для Каждого Стр Из Строки Цикл  
		Стр.ДатаБлокировки = ДатаБ;   	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбораДатаБлокировкиПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаВыбора.ТекущиеДанные; 
	Если НЕ ТекСтрока = неопределено Тогда
	   ОбработатьДатуБлокировки(ТекСтрока.ЗалоговыйБилет, ТекСтрока.ДатаБлокировки);  
	КонецЕсли;   
КонецПроцедуры
